SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32G0005/MM32G0005_Application/Device/MM32G0005/Include/reg_exti.h
/**
  * @brief EXTI_SWIER Register Bit Definition
  */
#define  EXTI_SWIER_SWIER0_Pos                    (0)
#define  EXTI_SWIER_SWIER0_Msk                    (0x1U << EXTI_SWIER_SWIER0_Pos)                   /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER0                        EXTI_SWIER_SWIER0_Msk
#define  EXTI_SWIER_SWIER1_Pos                    (1)
#define  EXTI_SWIER_SWIER1_Msk                    (0x1U << EXTI_SWIER_SWIER1_Pos)                   /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER1                        EXTI_SWIER_SWIER1_Msk
#define  EXTI_SWIER_SWIER2_Pos                    (2)
#define  EXTI_SWIER_SWIER2_Msk                    (0x1U << EXTI_SWIER_SWIER2_Pos)                   /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER2                        EXTI_SWIER_SWIER2_Msk
#define  EXTI_SWIER_SWIER3_Pos                    (3)
#define  EXTI_SWIER_SWIER3_Msk                    (0x1U << EXTI_SWIER_SWIER3_Pos)                   /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER3                        EXTI_SWIER_SWIER3_Msk
#define  EXTI_SWIER_SWIER4_Pos                    (4)
#define  EXTI_SWIER_SWIER4_Msk                    (0x1U << EXTI_SWIER_SWIER4_Pos)                   /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER4                        EXTI_SWIER_SWIER4_Msk
#define  EXTI_SWIER_SWIER5_Pos                    (5)
#define  EXTI_SWIER_SWIER5_Msk                    (0x1U << EXTI_SWIER_SWIER5_Pos)                   /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER5                        EXTI_SWIER_SWIER5_Msk
#define  EXTI_SWIER_SWIER6_Pos                    (6)
#define  EXTI_SWIER_SWIER6_Msk                    (0x1U << EXTI_SWIER_SWIER6_Pos)                   /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER6                        EXTI_SWIER_SWIER6_Msk
#define  EXTI_SWIER_SWIER7_Pos                    (7)
#define  EXTI_SWIER_SWIER7_Msk                    (0x1U << EXTI_SWIER_SWIER7_Pos)                   /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER7                        EXTI_SWIER_SWIER7_Msk
#define  EXTI_SWIER_SWIER8_Pos                    (8)
#define  EXTI_SWIER_SWIER8_Msk                    (0x1U << EXTI_SWIER_SWIER8_Pos)                   /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER8                        EXTI_SWIER_SWIER8_Msk
#define  EXTI_SWIER_SWIER9_Pos                    (9)
#define  EXTI_SWIER_SWIER9_Msk                    (0x1U << EXTI_SWIER_SWIER9_Pos)                   /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER9                        EXTI_SWIER_SWIER9_Msk
#define  EXTI_SWIER_SWIER10_Pos                   (10)
#define  EXTI_SWIER_SWIER10_Msk                   (0x1U << EXTI_SWIER_SWIER10_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER10                       EXTI_SWIER_SWIER10_Msk
#define  EXTI_SWIER_SWIER11_Pos                   (11)
#define  EXTI_SWIER_SWIER11_Msk                   (0x1U << EXTI_SWIER_SWIER11_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER11                       EXTI_SWIER_SWIER11_Msk
#define  EXTI_SWIER_SWIER12_Pos                   (12)
#define  EXTI_SWIER_SWIER12_Msk                   (0x1U << EXTI_SWIER_SWIER12_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER12                       EXTI_SWIER_SWIER12_Msk
#define  EXTI_SWIER_SWIER13_Pos                   (13)
#define  EXTI_SWIER_SWIER13_Msk                   (0x1U << EXTI_SWIER_SWIER13_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER13                       EXTI_SWIER_SWIER13_Msk
#define  EXTI_SWIER_SWIER14_Pos                   (14)
#define  EXTI_SWIER_SWIER14_Msk                   (0x1U << EXTI_SWIER_SWIER14_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER14                       EXTI_SWIER_SWIER14_Msk
#define  EXTI_SWIER_SWIER15_Pos                   (15)
#define  EXTI_SWIER_SWIER15_Msk                   (0x1U << EXTI_SWIER_SWIER15_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER15                       EXTI_SWIER_SWIER15_Msk
#define  EXTI_SWIER_SWIER16_Pos                   (16)
#define  EXTI_SWIER_SWIER16_Msk                   (0x1U << EXTI_SWIER_SWIER16_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER16                       EXTI_SWIER_SWIER16_Msk
#define  EXTI_SWIER_SWIER17_Pos                   (17)
#define  EXTI_SWIER_SWIER17_Msk                   (0x1U << EXTI_SWIER_SWIER17_Pos)                  /*!<software interrupt or event enable*/
#define  EXTI_SWIER_SWIER17                       EXTI_SWIER_SWIER17_Msk

/**
  * @brief EXTI_PR Register Bit Definition
  */
#define  EXTI_PR_PR0_Pos                          (0)
#define  EXTI_PR_PR0_Msk                          (0x1U << EXTI_PR_PR0_Pos)                         /*!<trigger pending bit*/
#define  EXTI_PR_PR0                              EXTI_PR_PR0_Msk
#define  EXTI_PR_PR1_Pos                          (1)
#define  EXTI_PR_PR1_Msk                          (0x1U << EXTI_PR_PR1_Pos)                         /*!<trigger pending bit*/
#define  EXTI_PR_PR1                              EXTI_PR_PR1_Msk
#define  EXTI_PR_PR2_Pos                          (2)
#define  EXTI_PR_PR2_Msk                          (0x1U << EXTI_PR_PR2_Pos)                         /*!<trigger pending bit*/
#define  EXTI_PR_PR2                              EXTI_PR_PR2_Msk
#define  EXTI_PR_PR3_Pos                          (3)
#define  EXTI_PR_PR3_Msk                          (0x1U << EXTI_PR_PR3_Pos)                         /*!<trigger pending bit*/
#define  EXTI_PR_PR3                              EXTI_PR_PR3_Msk
#define  EXTI_PR_PR4_Pos                          (4)
#define  EXTI_PR_PR4_Msk                          (0x1U << EXTI_PR_PR4_Pos)                         /*!<trigger pending bit*/
#define  EXTI_PR_PR4                              EXTI_PR_PR4_Msk
#define  EXTI_PR_PR5_Pos                          (5)
#define  EXTI_PR_PR5_Msk                          (0x1U << EXTI_PR_PR5_Pos)                         /*!<trigger pending bit*/
#define  EXTI_PR_PR5                              EXTI_PR_PR5_Msk
#define  EXTI_PR_PR6_Pos                          (6)
#define  EXTI_PR_PR6_Msk                          (0x1U << EXTI_PR_PR6_Pos)                         /*!<trigger pending bit*/
#define  EXTI_PR_PR6                              EXTI_PR_PR6_Msk
#define  EXTI_PR_PR7_Pos                          (7)
#define  EXTI_PR_PR7_Msk                          (0x1U << EXTI_PR_PR7_Pos)                         /*!<trigger pending bit*/
#define  EXTI_PR_PR7                              EXTI_PR_PR7_Msk
#define  EXTI_PR_PR8_Pos                          (8)
#define  EXTI_PR_PR8_Msk                          (0x1U << EXTI_PR_PR8_Pos)                         /*!<trigger pending bit*/
#define  EXTI_PR_PR8                              EXTI_PR_PR8_Msk
#define  EXTI_PR_PR9_Pos                          (9)
#define  EXTI_PR_PR9_Msk                          (0x1U << EXTI_PR_PR9_Pos)                         /*!<trigger pending bit*/
#define  EXTI_PR_PR9                              EXTI_PR_PR9_Msk
#define  EXTI_PR_PR10_Pos                         (10)
#define  EXTI_PR_PR10_Msk                         (0x1U << EXTI_PR_PR10_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR10                             EXTI_PR_PR10_Msk
#define  EXTI_PR_PR11_Pos                         (11)
#define  EXTI_PR_PR11_Msk                         (0x1U << EXTI_PR_PR11_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR11                             EXTI_PR_PR11_Msk
#define  EXTI_PR_PR12_Pos                         (12)
#define  EXTI_PR_PR12_Msk                         (0x1U << EXTI_PR_PR12_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR12                             EXTI_PR_PR12_Msk
#define  EXTI_PR_PR13_Pos                         (13)
#define  EXTI_PR_PR13_Msk                         (0x1U << EXTI_PR_PR13_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR13                             EXTI_PR_PR13_Msk
#define  EXTI_PR_PR14_Pos                         (14)
#define  EXTI_PR_PR14_Msk                         (0x1U << EXTI_PR_PR14_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR14                             EXTI_PR_PR14_Msk
#define  EXTI_PR_PR15_Pos                         (15)
#define  EXTI_PR_PR15_Msk                         (0x1U << EXTI_PR_PR15_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR15                             EXTI_PR_PR15_Msk
#define  EXTI_PR_PR16_Pos                         (16)
#define  EXTI_PR_PR16_Msk                         (0x1U << EXTI_PR_PR16_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR16                             EXTI_PR_PR16_Msk
#define  EXTI_PR_PR17_Pos                         (17)
#define  EXTI_PR_PR17_Msk                         (0x1U << EXTI_PR_PR17_Pos)                        /*!<trigger pending bit*/
#define  EXTI_PR_PR17                             EXTI_PR_PR17_Msk


#endif

